src/Reports/ОтчётПоИзделиямНаЛинейках/ОтчётПоИзделиямНаЛинейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоИзделиямНаЛинейках</name>
</mdclass:Report>

src/Catalogs/НезапущенныеИзделия/НезапущенныеИзделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НезапущенныеИзделия</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗапуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Запущено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗапусков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗапусковЗаЦикл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвободныйОстатокНаСкладеГП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВПроизводстве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ОтчётПоИзделиямНаЛинейках/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ТаблицаИзделий = Новый ТаблицаЗначений;

ТаблицаИзделий.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаИзделий.Колонки.Добавить("Изделие",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаИзделий.Колонки.Добавить("КолПроизв",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,3)));
ТаблицаИзделий.Колонки.Добавить("КолНезап",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,3)));
ТаблицаИзделий.Колонки.Добавить("КолПЭО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,3)));


ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Изделие,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Линейка
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних(&НаДату, ) КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Линейка В(&СписокЛинеек)
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания = &ДатаОкончания";
Запрос.УстановитьПараметр("НаДату",ТекущаяДата());
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаОкончания",Дата(1,1,1));
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаИзделий.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Изделие = Выборка.Изделие;
		Если ЗначениеЗаполнено(Выборка.ПЗ.ДатаЗапуска) Тогда
		ТЧ.КолПроизв = 1;
		Иначе
		ТЧ.КолНезап = 1;	
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	НезапущенныеИзделия.Изделие КАК Изделие,
	|	НезапущенныеИзделия.Количество КАК Количество,
	|	НезапущенныеИзделия.Линейка КАК Линейка
	|ИЗ
	|	Справочник.НезапущенныеИзделия КАК НезапущенныеИзделия
	|ГДЕ
	|	НезапущенныеИзделия.Линейка В(&СписокЛинеек)
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Линейка,
	|	Изделие";
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейка.Следующий() Цикл
	Выборка = ВыборкаЛинейка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
		ТЧ = ТаблицаИзделий.Добавить();
		ТЧ.Линейка = ВыборкаЛинейка.Линейка;
		ТЧ.Изделие = Выборка.Изделие;
		ТЧ.КолПЭО = Выборка.Количество;
		КонецЦикла;
	КонецЦикла;
ТаблицаИзделий.Свернуть("Линейка,Изделие","КолПроизв,КолНезап,КолПЭО");
ТаблицаИзделий.Сортировать("Линейка,Изделие");
	Для каждого ТЧ Из ТаблицаИзделий Цикл
	Отбор = Новый Структура("МПЗ",ТЧ.Изделие);
	СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.ПолучитьПоследнее(ТекущаяДата(),Отбор); 
	ОблМПЗ.Параметры.Линейка = ТЧ.Линейка;		
	ОблМПЗ.Параметры.Наименование = СокрЛП(ТЧ.Изделие.Наименование);
	ОблМПЗ.Параметры.Изделие = ТЧ.Изделие;
	ОблМПЗ.Параметры.Статус = СтатусыМПЗ.Статус;
	ОблМПЗ.Параметры.КолПроизв = ТЧ.КолПроизв;
	ОблМПЗ.Параметры.КолНезап = ТЧ.КолНезап;

	ОблМПЗ.Параметры.КолПЭО = ТЧ.КолПЭО;
	ОблМПЗ.Параметры.КолВсего = ТЧ.КолПроизв + ТЧ.КолНезап + ТЧ.КолПЭО;
	ТабДок.Вывести(ОблМПЗ);
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 4;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры
